BiblioRaul/app/Http/Controllers/AtividadeController.php

    public function index()
    {
        // Mostrar as atividades do mês atual [Eloquent]
        $atividade = Atividade::latest()
            ->whereMonth('inicio', Carbon::now()->month)
            ->get();
        setlocale(LC_COLLATE, 'pt-PT.utf8');
        $user = User::all()->sortBy('nome', SORT_LOCALE_STRING);
        $local = Local::all()->sortBy('nome', SORT_LOCALE_STRING);
        $professor = Professor::all()->sortBy('nome', SORT_LOCALE_STRING);
        $turma = Turma::all()->sortBy('id');
        $recurso = Recurso::all()->sortBy('nome', SORT_LOCALE_STRING);
---
select * from `atividade` where month(`inicio`) = '03' and year(`inicio`) = '2020' order by `created_at` desc
select * from `user`
select * from `local`
select * from `professor`
select * from `turma`
select * from `recurso`

    public function store(Request $request)
    {
        // dd(request()->all());
        $this->validateNewAtividade();

        $atividade = new Atividade(request(['nome', 'user_id', 'local_id', 'recurso_id', 'inicio', 'fim', 'total_espectadores', 'outros_espectadores', 'num_recursos', 'observacao']));
        $atividade->user_id = Auth::user()->id;
        $atividade->local_id = $request->new_local_id;
        $atividade->recurso_id = $request->new_recurso_id;
        $atividade->inicio = Carbon::parse($request->inicio)->format('Y-m-d H:i:s');
        $atividade->fim = empty($request->fim) ? null : Carbon::parse($request->fim)->format('Y-m-d H:i:s');
        $atividade->num_recursos = $request->new_num_recursos;
        $atividade->save();

        $atividade->turmas()->attach(request('new_turmas'));
---
insert into `atividade` (`nome`, `total_espectadores`, `outros_espectadores`, `observacao`, `user_id`, `local_id`, `recurso_id`, `inicio`, `fim`, `num_recursos`, `updated_at`, `created_at`) values ('atividade de março de 2021', '120', '', '', 1, '18', '', '2021-03-04 13:00:00', '', '', '2020-02-14 11:32:23', '2020-02-14 11:32:23')

    public function destroy(Request $request)
    {
        $atividade = Atividade::findOrFail($request->atividade_id);
        $atividade->delete();
---
delete from `atividade` where `id` = 31